{
    "title": "Знакомство с GO",
    "blocks": [
        {
            "type": "img",
            "data": "https://web-cpv.ru/wp-content/uploads/2020/12/parallelizm-v-golang-i-workerpool-chast-2-fa8226e.jpg"
        },
        {
            "type": "text",
            "data": "Golang - это opensource язык программирования, который позволяет быстро и эффективно писать код."
        },
        {
            "type": "text",
            "data": "Разработкой языка занимается компания Google c 2007 года. У истоков стоят такие именитые инженеры и разработчкики как Кен Томпсон, Роберт Гризмер, и главный вдохновитель - Роб Пайк."
        },
        {
            "type": "text",
            "data": "Благодаря своей открытости и простоте, компилятор языка существует для множества операционных систем, таких как macOS, Linux, Windows, FreeBSD, Plan 9, Android и т.д."
        },
        {
            "type": "text",
            "data": "Более подробную информацию о создании и идеологии языка вы можете найти на официальной страцице в Википедии по ссылке внизу."
        },
        {
            "type": "link",
            "data": "https://ru.wikipedia.org/wiki/Go",
            "extra": {
                "icon": "info",
                "text": "Язык программирования GO"
            }
        },
        {
            "type": "text",
            "data": "Golang имеет простой синтаксис, строгую типизацию, поддержку многопоточности, безопасную работу с памятью и \"сборщик мусора\" (garbage collector). Ниже приведен пример кода, который выводит на экран фразу \"Hello world!\"."
        },
        {
            "type": "code",
            "extra": {
                "languages": ["go"],
                "fileName": "main.go"
            },
            "$ref": "presentations/golang/intro/assets/example.go"
        },
        {
            "type": "text",
            "data": "Для того, чтобы запустить данный код у себя на компьютере, необходимо скачать и установить компилятор. Перейдите по ссылке ниже и следуйте инструкциям по установке."
        },
        {
            "type": "link",
            "data": "https://golang.org/dl/",
            "extra": {
                "icon": "download",
                "text": "Скачать компилятор GO",
                "fg": "#fff",
                "bg": "#0bc5ea"
            }
        },
        {
            "type": "text",
            "data": "Следующий шаг - установка редактора (IDE) для дальнейшей разработки. В отличие от других языков, для go не требуется скачивать специализированную среду разработки или редактор кода. Подойдет любой текстовый редактор, в том числе терминальный (консольный)."
        },
        {
            "type": "text",
            "data": "Тем не менее, для вашего комфорта, если у вас нет личных предпочтений в выборе, то рекомендуется скачать одну из ниже приведенных IDE:"
        },
        {
            "type": "link",
            "data": "https://code.visualstudio.com/download",
            "extra": {
                "icon": "download",
                "text": "VSCode"
            }
        },
        {
            "type": "link",
            "data": "https://www.jetbrains.com/go/",
            "extra": {
                "icon": "download",
                "text": "GoLand"
            }
        },
        {
            "type": "link",
            "data": "https://www.sublimetext.com/3",
            "extra": {
                "icon": "download",
                "text": "Sublime Text"
            }
        },
        {
            "type": "text",
            "data": "После установки компилятора и редактора, создайте в нем файл main.go и скопируйте туда код, представленный выше. Затем в терминале, находясь в папке с файлом, выполните команду go run main.go. В результате вы получите следующий результат:"
        },
        {
            "type": "bash",
            "data": "go run main.go\nHello world!"
        },
        {
            "type": "text",
            "data": "В завершение этой главы, перейдите по ссылке ниже, для того, чтобы ознакомиться с официальным руководством от разработчиков языка. Это руководство понадобится вам в дальнейшем, при прохождении данного курса."
        },
        {
            "type": "link",
            "data": "https://tour.golang.org/welcome/1",
            "extra": {
                "icon": "school",
                "text": "Тур по языку"
            }
        },
        {
            "type": "text",
            "data": "Хорошего дня!"
        }
    ]
}
